package com.ssafy.trippy.place.model;

import org.springframework.stereotype.Component;

import lombok.Getter;

@Getter
@Component
public class DongList {
	String[] daejeonDongs = {
//		    "가양동","가양1동", "가양2동", "대동", "대청동", "삼성동", "성남동", "용운동", "자양동", "중앙동", "홍도동", "효동", // 동구
//		    "대사동", "대흥동", "목동", "문화1동", "문화2동", "부사동", "석교동", "오류동", "은행선화동", "중촌동", "태평1동", "태평2동", // 중구
//		    "가장동", "갈마동", "갈마1동", "갈마2동", "관저동", "관저1동", "관저2동", "기성동", "둔산동", "둔산1동", "둔산2동", "둔산3동", "만년동", "변동", "복수동", "용문동", "월평동","월평1동", "월평2동", "월평3동", "정림동", "탄방동", // 서구
//		    "계산동", "관평동", "구즉동", "노은1동", "노은2동", "노은3동", "대정동", "반석동", "송강동", "신성동", "유성동", "장대동", "전민동", "진잠동", "학하동", // 유성구
//		    "법동", "법1동", "법2동", "비래동", "송촌동", "오정동", "중리동", "회덕동" // 대덕구
			"가양동", "가오동", "대동", "대별동", "대성동", "대청동", "동대동", "삼성동", "삼정동", "성남동", "성북동", "신상동", "신안동", "신인동", "신흥동", "용운동", "용전동", "이사동", "자양동", "장안동", "정동", "중동", "추동", "판암동", "홍도동", "효동",
			"구완동", "대사동", "대흥동", "목동", "문창동", "문화동", "부사동", "사정동", "산성동", "석교동", "선화동", "오류동", "용두동", "은행동", "전민동", "중촌동", "침산동", "태평동",
			"가수원동", "가장동", "갈마동", "관저동", "관평동", "괴곡동", "괴정동", "기성동", "내동", "둔산동", "만년동", "복수동", "봉산동", "변동", "용문동", "월평동", "월평1동", "월평2동", "월평3동", "월드컵동", "정림동", "탄방동", "평촌동", "화정동",
			"계산동", "관평동", "구암동", "궁동", "노은동", "대정동", "덕명동", "덕진동", "도룡동", "방동", "반석동", "봉명동", "상대동", "신성동", "용계동", "원내동", "원신흥동", "장대동", "전민동", "진잠동", "충효동", "탑립동", "하기동", "화암동", "회덕동",
			"법동", "비래동", "석봉동", "송촌동", "신대동", "신탄진동", "오정동", "중리동", "회남동", "회동"
			
		};


	
	
}
